Repository: Furry-Xiyi/Vite-Web-App-Container
Catalog: WinUIonWebUWP/WinUIonWebUWP.Package/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# AppDisplayName
source: Vite/Web App Container
zh_cn: Vite/Web 应用容器

# HomeItem.Content
source: Container
zh_cn: 容器页

# AppearanceGroup.Text
source: Appearance
zh_cn: 外观

# ThemeTitle.Text
source: App Theme
zh_cn: 应用主题

# ThemeSubtitle.Text
source: Select the app theme to display
zh_cn: 选择要显示的应用主题

# ThemeSystem.Content
source: System Default
zh_cn: 跟随系统

# ThemeLight.Content
source: Light
zh_cn: 浅色

# ThemeDark.Content
source: Dark
zh_cn: 深色

# MaterialTitle.Text
source: Background Material
zh_cn: 背景材质

# MaterialSubtitle.Text
source: Select the app material to display
zh_cn: 选择要显示的应用材质

# PanePositionLeft.Content
source: Left
zh_cn: 左侧

# PanePositionTop.Content
source: Top
zh_cn: 顶部

# SoundGroup.Text
source: Sound
zh_cn: 声音

# SoundToggle.Header
source: Enable Control Sounds
zh_cn: 启用控件声音

# AboutGroup.Text
source: About
zh_cn: 关于

# QQGroup.Text
source: QQ Group
zh_cn: QQ 群

# DiscordGroup.Text
source: Discord Channel
zh_cn: Discord 频道

# Feedback.Text
source: Send Feedback
zh_cn: 发送反馈

# ExternalOpenDialog.Title
source: This app is trying to open an external application
zh_cn: 此应用尝试打开外部应用

# ExternalOpenDialog.PrimaryButtonText
source: Yes
zh_cn: 是

# ExternalOpenDialog.SecondaryButtonText
source: No
zh_cn: 否

# DialogMessage.Text
source: Do you allow it?
zh_cn: 是否允许？

# Settings_SoundCard.Description
source: Control interaction sounds in the app
zh_cn: 控制应用中的交互提示音

# Settings_NavCard.Description
source: Select the navigation bar position to display
zh_cn: 选择要显示的导航栏位置

# Settings_SoundCard.Header
source: Control sound
zh_cn: 控件声音

# Settings_NavCard.Header
source: Navigation Pane Position
zh_cn: 导航栏位置

# Settings_Breadcrumb
source: Settngs
zh_cn: 设置

# MoreButton.ToolTipService.ToolTip
source: More
zh_cn: 更多

# UrlErrorText.Text
source: The input is not a valid URL
zh_cn: 输入的不是正确网址

# LauncherUrlErrorText.Text
source: The input is not a valid URL
zh_cn: 输入的不是正确网址

# LauncherUrlTextBox.PlaceholderText
source: Enter a URL
zh_cn: 请输入网址

# LauncherAddButton.Content
source: Add
zh_cn: 添加

# RestoreUrlButton.Content
source: Restore
zh_cn: 还原

# CancelUrlButton.Content
source: Cancel
zh_cn: 取消

# SaveUrlButton.Content
source: Apply
zh_cn: 应用

# PinnedSiteInfoHeaderText
source: App information
zh_cn: 应用信息

# PinnedSiteInfoPublisherFormat
source: Publisher: {0}
zh_cn: 发布者：{0}

# TransparentWebViewScript
source: (()=>{window.__WINUI_ON_WEB_UWP_APP__=true;const root=document.documentElement;root.classList.add('winui-webview-host');const id='winui-on-web-transparent-background';let style=document.getElementById(id);if(!style){style=document.createElement('style');style.id=id;(document.head||root).appendChild(style);}style.textContent=`html.winui-webview-host{--app-bg:transparent!important;--host-layer-default:rgba(255,255,255,.50);--host-nav-pane-bg:rgba(243,243,243,.72);--host-flyout-bg:rgba(252,252,252,.78);background:transparent!important;background-color:transparent!important;}@media (prefers-color-scheme:dark){html.winui-webview-host{--host-layer-default:rgba(58,58,58,.25);--host-nav-pane-bg:rgba(32,32,32,.72);--host-flyout-bg:rgba(44,44,44,.78);}}html.winui-webview-host body,html.winui-webview-host #app,html.winui-webview-host .win-nav-shell{background:transparent!important;background-color:transparent!important;}html.winui-webview-host .win-nav-top-bar{background-color:transparent!important;}html.winui-webview-host .win-nav-content{background:var(--host-layer-default)!important;background-color:var(--host-layer-default)!important;}html.winui-webview-host .win-nav-shell.is-overlay-left .win-nav-left-panel:not(.is-compact){background:var(--host-nav-pane-bg)!important;background-color:var(--host-nav-pane-bg)!important;backdrop-filter:blur(28px) saturate(1.35)!important;-webkit-backdrop-filter:blur(28px) saturate(1.35)!important;}html.winui-webview-host .win-menu-flyout{background:var(--host-flyout-bg)!important;background-color:var(--host-flyout-bg)!important;backdrop-filter:var(--flyout-backdrop)!important;-webkit-backdrop-filter:var(--flyout-backdrop)!important;}`;})()
zh_cn: (()=>{window.__WINUI_ON_WEB_UWP_APP__=true;const root=document.documentElement;root.classList.add('winui-webview-host');const id='winui-on-web-transparent-background';let style=document.getElementById(id);if(!style){style=document.createElement('style');style.id=id;(document.head||root).appendChild(style);}style.textContent=`html.winui-webview-host{--app-bg:transparent!important;background:transparent!important;background-color:transparent!important;}html.winui-webview-host:not(.theme-dark){--host-layer-default:rgba(255,255,255,.50);--host-nav-pane-bg:rgba(243,243,243,.72);--host-flyout-bg:rgba(252,252,252,.78);}html.winui-webview-host.theme-dark{--host-layer-default:rgba(58,58,58,.25);--host-nav-pane-bg:rgba(32,32,32,.72);--host-flyout-bg:rgba(44,44,44,.78);}@media (prefers-color-scheme:dark){html.winui-webview-host:not(.theme-light){--host-layer-default:rgba(58,58,58,.25);--host-nav-pane-bg:rgba(32,32,32,.72);--host-flyout-bg:rgba(44,44,44,.78);}}html.winui-webview-host body,html.winui-webview-host #app,html.winui-webview-host .win-nav-shell{background:transparent!important;background-color:transparent!important;}html.winui-webview-host .win-nav-top-bar{background-color:transparent!important;}html.winui-webview-host .win-nav-content{background:var(--host-layer-default)!important;background-color:var(--host-layer-default)!important;}html.winui-webview-host .win-nav-shell.is-overlay-left .win-nav-left-panel:not(.is-compact){background:var(--host-nav-pane-bg)!important;background-color:var(--host-nav-pane-bg)!important;backdrop-filter:blur(28px) saturate(1.35)!important;-webkit-backdrop-filter:blur(28px) saturate(1.35)!important;}html.winui-webview-host .win-menu-flyout{background:var(--host-flyout-bg)!important;background-color:var(--host-flyout-bg)!important;backdrop-filter:var(--flyout-backdrop)!important;-webkit-backdrop-filter:var(--flyout-backdrop)!important;}`;})()

# UrlAutoSuggestBox.Header
source: Custom URL
zh_cn: 自定义网址

# UrlAutoSuggestBox.PlaceholderText
source: Enter a URL
zh_cn: 请输入网址

# DeleteUrlHistoryButton.ToolTipService.ToolTip
source: Delete history item
zh_cn: 删除历史记录

# SettingsEntryText.Text
source: Application settings
zh_cn: 应用设置

# BehaviorGroup.Text
source: Behavior
zh_cn: 行为

# TransparentCssCard.Header
source: Transparent background CSS logic
zh_cn: 背景透明 CSS 逻辑

# TransparentCssCard.Description
source: Manage the transparent background rules injected into the web page
zh_cn: 管理注入到网页中的透明背景规则

# PerSiteCssToggle.OnContent
source: Per-site settings
zh_cn: 按网页设置

# PerSiteCssToggle.OffContent
source: Global settings
zh_cn: 不按网页设置

# AddCssRuleButton.ToolTipService.ToolTip
source: Add CSS rule
zh_cn: 添加 CSS 规则

# SettingsBackButton.ToolTipService.ToolTip
source: Back
zh_cn: 返回

# DeleteCssRuleButton.ToolTipService.ToolTip
source: Delete CSS rule
zh_cn: 删除 CSS 规则

# CssRuleFallbackHeader
source: CSS rule
zh_cn: CSS 规则

# CssHostBox.PlaceholderText
source: Web host
zh_cn: 网页主机名

# CssSelectorBox.PlaceholderText
source: Selector
zh_cn: 选择器

# CssContentBox.PlaceholderText
source: CSS content
zh_cn: CSS 内容

# SaveCssRuleButton.Content
source: Save
zh_cn: 保存

# DeleteCssRuleDialogPrimaryButtonText
source: Delete
zh_cn: 删除

# DeleteCssRuleDialog.Title
source: Delete CSS rule
zh_cn: 删除 CSS 规则

# DeleteCssRuleDialog.PrimaryButtonText
source: Delete
zh_cn: 删除

# DeleteCssRuleDialog.CloseButtonText
source: Cancel
zh_cn: 取消

# DeleteCssRuleDialogMessage.Text
source: Delete this CSS rule?
zh_cn: 确定要删除这条 CSS 规则吗？

# DeveloperGroup.Text
source: Developer
zh_cn: 开发者

# F12DevToolsCard.Header
source: F12 Developer Tools
zh_cn: F12 开发人员工具

# F12DevToolsCard.Description
source: Control whether pinned sites can open WebView developer tools
zh_cn: 控制已固定网址是否允许打开 WebView 开发人员工具

# WebIntegrationCard.Header
source: Web app integration
zh_cn: Web 应用接入

# WebIntegrationCard.Description
source: How Vite or regular Web apps can request app background material changes
zh_cn: 说明 Vite 或普通 Web 应用如何请求修改应用主题与背景材质

# WebMaterialIntegrationCard.Header
source: Material
zh_cn: 材质

# WebMaterialIntegrationCard.Description
source: Web pages can request the host app background material; this only applies inside the UWP WebView host
zh_cn: 网页可请求宿主应用切换背景材质；仅在 UWP WebView 宿主内生效

# PinContainerText.Text
source: Pin current site to Start
zh_cn: 固定当前网页到开始菜单

# PinUnavailableInfoButton.ToolTipService.ToolTip
source: Details
zh_cn: 详情

# PinUnavailableTeachingTip.Title
source: This action is currently unavailable
zh_cn: 此操作当前不可用

# PinUnavailableTeachingTip.Subtitle
source: Please wait until the page finishes loading and try again
zh_cn: 请等待网页完整加载后重试

# PinUnavailableTeachingTipContent.Text
source: Pinning before the page finishes loading can lose the app name
zh_cn: 若不等网页加载完就固定会导致应用名称丢失

# PinUnavailableTeachingTipActionText.Text
source: Got it
zh_cn: 我知道了

# RenameTileDialog.Title
source: Rename app entry
zh_cn: 需要修改应用名称

# RenameTileDialog.PrimaryButtonText
source: Rename and continue
zh_cn: 修改名称并继续

# RenameTileDialog.CloseButtonText
source: Don't add
zh_cn: 不添加

# RenameTileDialogMessage.Text
source: This name is empty or already used by a Start menu item.
zh_cn: 此名称为空或已被固定到开始菜单的项目使用。

# RenameTileDialogNameTextBox.Header
source: App name
zh_cn: 应用名称

# RenameTileDialogNameErrorText.Text
source: Please change the name first
zh_cn: 请先修改名称

# DownloadsEntryText.Text
source: Downloads
zh_cn: 下载

# DownloadTitleBarButton.ToolTipService.ToolTip
source: Downloads
zh_cn: 下载

# DownloadTitleBarProgressToolTipFormat
source: Downloads - {0}%
zh_cn: 下载 - {0}%

# DownloadsPanelTitle.Text
source: Downloads
zh_cn: 下载

# DownloadsEmptyText.Text
source: No downloads yet
zh_cn: 暂无下载内容

# OpenDownloadsFolderButton.ToolTipService.ToolTip
source: Open downloads folder
zh_cn: 打开下载文件夹

# PinDownloadsPanelButton.ToolTipService.ToolTip
source: Pin to title bar
zh_cn: 固定到标题栏

# OpenDownloadItemButton.ToolTipService.ToolTip
source: Open file
zh_cn: 打开文件

# CancelDownloadItemButton.ToolTipService.ToolTip
source: Cancel download
zh_cn: 取消下载

# PinDownloadsToTitleBarMenuItem.Text
source: Pin to title bar
zh_cn: 固定到标题栏

# UnpinDownloadsFromTitleBarMenuItem.Text
source: Unpin from title bar
zh_cn: 从标题栏取消固定

# DownloadItemUnknownFile
source: Downloaded file
zh_cn: 下载文件

# DownloadStatusInProgressFormat
source: Downloaded {0} · {1}
zh_cn: 已下载 {0} · {1}

# DownloadStatusInProgressWithTotalFormat
source: Downloaded {0} of {1} · {2}
zh_cn: 已下载 {0}，共 {1} · {2}

# DownloadStatusCompleted
source: Completed
zh_cn: 已完成

# DownloadStatusInterrupted
source: Interrupted
zh_cn: 下载中断

# WebViewLoadingText.Text
source: Loading
zh_cn: 正在加载

# NavigationErrorTitle.Text
source: Can't open this page
zh_cn: 无法打开此页面

# NavigationErrorMessageFormat
source: Page load failed: {0}
zh_cn: 页面加载失败：{0}

# RetryNavigationButton.Content
source: Retry
zh_cn: 重试

# CopyNavigationUrlButton.Content
source: Copy link
zh_cn: 复制链接

# OpenNavigationExternalButton.Content
source: Open in browser
zh_cn: 在浏览器中打开

# NavigationError_Unknown
source: Unknown error
zh_cn: 未知错误

# NavigationError_CertificateCommonNameIsIncorrect
source: Certificate name mismatch
zh_cn: 证书名称不匹配

# NavigationError_CertificateExpired
source: Certificate expired
zh_cn: 证书已过期

# NavigationError_ClientCertificateContainsErrors
source: Client certificate contains errors
zh_cn: 客户端证书存在错误

# NavigationError_CertificateRevoked
source: Certificate revoked
zh_cn: 证书已被吊销

# NavigationError_CertificateIsInvalid
source: Certificate is invalid
zh_cn: 证书无效

# NavigationError_ServerUnreachable
source: Server unreachable
zh_cn: 无法连接到服务器

# NavigationError_Timeout
source: Connection timed out
zh_cn: 连接超时

# NavigationError_ErrorHttpInvalidServerResponse
source: Invalid server response
zh_cn: 服务器响应无效

# NavigationError_ConnectionAborted
source: Connection aborted
zh_cn: 连接已中止

# NavigationError_ConnectionReset
source: Connection reset
zh_cn: 连接已重置

# NavigationError_Disconnected
source: Network disconnected
zh_cn: 网络已断开

# NavigationError_CannotConnect
source: Cannot connect
zh_cn: 无法建立连接

# NavigationError_HostNameNotResolved
source: Host name not resolved
zh_cn: 无法解析主机名

# NavigationError_OperationCanceled
source: Operation canceled
zh_cn: 操作已取消

# NavigationError_RedirectFailed
source: Redirect failed
zh_cn: 重定向失败

# NavigationError_UnexpectedError
source: Unexpected error
zh_cn: 出现意外错误

# PermissionRequestDialog.Title
source: Site permission request
zh_cn: 网站权限请求

# PermissionRequestDialog.PrimaryButtonText
source: Allow
zh_cn: 允许

# PermissionRequestDialog.SecondaryButtonText
source: Deny
zh_cn: 拒绝

# PermissionRequestMessageFormat
source: This site wants to use “{0}”.
zh_cn: 此网站想要使用“{0}”。

# PermissionRequestOriginFormat
source: Origin: {0}
zh_cn: 来源：{0}

# PermissionRequestUserInitiated
source: This request was triggered by a user action
zh_cn: 此请求由用户操作触发

# PermissionRequestNotUserInitiated
source: This request was not triggered by a user action
zh_cn: 此请求不是由用户操作触发

# RememberPermissionDecisionCheckBox.Content
source: Remember this choice
zh_cn: 记住此选择

# PermissionKind_UnknownPermission
source: Unknown permission
zh_cn: 未知权限

# PermissionKind_Microphone
source: microphone
zh_cn: 麦克风

# PermissionKind_Camera
source: camera
zh_cn: 摄像头

# PermissionKind_Geolocation
source: location
zh_cn: 位置

# PermissionKind_Notifications
source: notifications
zh_cn: 通知

# PermissionKind_OtherSensors
source: sensors
zh_cn: 传感器

# PermissionKind_ClipboardRead
source: clipboard read
zh_cn: 剪贴板读取

# PermissionKind_MultipleAutomaticDownloads
source: multiple automatic downloads
zh_cn: 多个自动下载

# PermissionKind_FileReadWrite
source: file read and write
zh_cn: 文件读写

# PermissionKind_Autoplay
source: autoplay
zh_cn: 自动播放

# PermissionKind_LocalFonts
source: local fonts
zh_cn: 本地字体

# PermissionKind_MidiSystemExclusiveMessages
source: MIDI system exclusive messages
zh_cn: MIDI 系统专有消息

# PermissionKind_WindowManagement
source: window management
zh_cn: 窗口管理

# NavigationError_ValidAuthenticationCredentialsRequired
source: Valid authentication credentials required
zh_cn: 需要有效的身份验证凭据

# NavigationError_ValidProxyAuthenticationRequired
source: Valid proxy authentication credentials required
zh_cn: 需要有效的代理身份验证凭据

# DownloadDefaultFileName
source: download
zh_cn: 下载文件

# PinDownloadsPanelButtonToolTip
source: Pin to title bar
zh_cn: 固定到标题栏

# UnpinDownloadsPanelButtonToolTip
source: Unpin from title bar
zh_cn: 从标题栏取消固定

# ContainerManagement_Breadcrumb
source: Containers
zh_cn: 容器管理

# ContainersGroup.Text
source: Containers
zh_cn: 容器

# ContainersManagementCard.Header
source: Container management
zh_cn: 容器管理

# ContainersManagementCard.Description
source: Manage created web containers, URLs, icons, and data
zh_cn: 管理已创建的网页容器、网址、图标和数据

# ContainerManagementGroup.Text
source: Created containers
zh_cn: 已创建的容器

# ContainerOpenButton.Content
source: Open
zh_cn: 打开

# ContainerNameBox.Header
source: Name
zh_cn: 名称

# ContainerUrlBox.Header
source: URL
zh_cn: 网址

# ContainerRefreshIconButton.ToolTipService.ToolTip
source: Refresh icon
zh_cn: 刷新图标

# ContainerClearDataButton.ToolTipService.ToolTip
source: Clear container data
zh_cn: 清理容器数据

# ContainerUnpinButton.ToolTipService.ToolTip
source: Unpin from Start
zh_cn: 从开始菜单取消固定

# ContainerDeleteButton.ToolTipService.ToolTip
source: Delete container
zh_cn: 删除容器

# ContainerSaveButton.Content
source: Save
zh_cn: 保存

# SitePermissions_Breadcrumb
source: Site permissions
zh_cn: 站点权限设置

# SitePermissionsEntryText.Text
source: Site permissions
zh_cn: 站点权限设置

# SitePermissionsGroup.Text
source: Current site permissions
zh_cn: 当前站点权限

# SitePermissionsOriginFormat
source: Origin: {0}
zh_cn: 来源：{0}

# PermissionStateAsk.Content
source: Ask
zh_cn: 询问

# PermissionStateAllow.Content
source: Allow
zh_cn: 允许

# PermissionStateDeny.Content
source: Deny
zh_cn: 拒绝

# OpenDownloadInlineButton.Content
source: Open file
zh_cn: 打开文件

# ToggleDownloadItemButton.ToolTipService.ToolTip
source: Pause or resume
zh_cn: 暂停或继续

# OpenDownloadItemMenuItem.Text
source: Open
zh_cn: 打开

# ShowDownloadInFolderMenuItem.Text
source: Show in folder
zh_cn: 在文件夹中显示

# PauseDownloadItemMenuItem.Text
source: Pause
zh_cn: 暂停

# ResumeDownloadItemMenuItem.Text
source: Resume
zh_cn: 继续

# CancelDownloadItemMenuItem.Text
source: Cancel
zh_cn: 取消

# RemoveDownloadItemMenuItem.Text
source: Remove from list
zh_cn: 从列表中移除

# DownloadStatusPaused
source: Paused
zh_cn: 已暂停

# DownloadSpeedFormat
source: {0}/s
zh_cn: {0}/秒

# DownloadStatusDeleted
source: File deleted
zh_cn: 文件已删除

# SettingsPageMigratedTitle.Text
source: This page has moved
zh_cn: 此页面已迁移

# SettingsPageMigratedDescription.Text
source: Settings have moved to AboutPage. Add and maintain future settings in AboutPage.
zh_cn: 设置功能已迁移至 AboutPage。后续请在 AboutPage 中添加和维护设置项。

# CopyDownloadLinkMenuItem.Text
source: Copy download link
zh_cn: 复制下载链接

# ReportUnsafeDownloadMenuItem.Text
source: Report this file as unsafe
zh_cn: 将此文件报告为不安全

# ShowDownloadInFolderButton.ToolTipService.ToolTip
source: Show in folder
zh_cn: 在文件夹中显示

# DeleteDownloadFileButton.ToolTipService.ToolTip
source: Delete file
zh_cn: 删除文件

# DownloadFolderCard.Header
source: Default download folder
zh_cn: 下载文件默认保存路径

# DownloadFolderCard.Description
source: Set where WebView downloads are saved
zh_cn: 设置 WebView 下载文件保存到的位置

# BrowseDownloadFolderButton.Content
source: Browse
zh_cn: 浏览

# DownloadFolderAccessDialog.Title
source: File system access required
zh_cn: 需要开启文件系统访问

# DownloadFolderAccessDialog.PrimaryButtonText
source: Open settings
zh_cn: 打开设置

# DownloadFolderAccessDialog.CloseButtonText
source: Later
zh_cn: 稍后

# DownloadFolderAccessDialogMessage.Text
source: Downloads need access to the default save folder. Allow this app to access the file system in Windows Settings, then try again. If it is already enabled, restart the app or choose the folder again from the download path setting on AboutPage.
zh_cn: 下载需要访问默认保存路径。请在 Windows 设置中允许此应用访问文件系统后重试；如果已经开启，请重启应用，或在 AboutPage 的下载路径设置中重新选择文件夹。

# DeleteDownloadFileMenuItem.Text
source: Delete file
zh_cn: 删除文件

# ViteDevServerCard.Header
source: Vite Dev Server
zh_cn: Vite 开发服务器

# ViteDevServerCard.Description
source: Configure the local debug URL, start command, and runtime status
zh_cn: 配置本机调试地址、启动命令和运行状态

# ViteStartButton.Content
source: Start
zh_cn: 启动

# ViteStopButton.Content
source: Stop
zh_cn: 停止

# ViteRetryButton.Content
source: Retry
zh_cn: 重试

# ViteServerConfigCard.Header
source: Local debugging
zh_cn: 本机调试

# ViteServerConfigCard.Description
source: Quickly target localhost:5173, or set a custom port and path
zh_cn: 快速指向 localhost:5173，或设置自定义端口和路径

# ViteHostBox.Header
source: Host
zh_cn: 主机

# VitePortNumberBox.Header
source: Port
zh_cn: 端口

# ViteUsePathCheckBox.Content
source: Append path
zh_cn: 附加路径

# VitePathBox.Header
source: Path
zh_cn: 路径

# VitePathBox.PlaceholderText
source: For example app/ or docs/
zh_cn: 例如 app/ 或 docs/

# ViteCommandBox.Header
source: Start command
zh_cn: 启动命令

# ViteWorkingDirectoryBox.Header
source: Project folder
zh_cn: 项目目录

# ViteWorkingDirectoryBox.PlaceholderText
source: Choose the Vite project folder
zh_cn: 选择 Vite 项目所在文件夹

# ViteBrowseFolderButton.Content
source: Browse
zh_cn: 浏览

# ViteOpenFolderButton.Content
source: Open
zh_cn: 打开

# ViteUseDefaultButton.Content
source: Use localhost:5173
zh_cn: 使用 localhost:5173

# ViteOpenUrlButton.Content
source: Open debug URL
zh_cn: 打开调试地址

# ViteReloadCurrentButton.Content
source: Reload current container
zh_cn: 重新加载当前容器

# ViteServerStatusCard.Header
source: Status and logs
zh_cn: 状态与日志

# ViteServerStatusCard.Description
source: Watch dev server reachability and warn when HMR disconnects
zh_cn: 监听 dev server 是否可达，并提示 HMR 断线

# ViteStatusNotChecked
source: Dev server status has not been checked yet
zh_cn: 尚未检查开发服务器状态

# ViteStatusOnlineFormat
source: {0} is reachable, HTTP {1}
zh_cn: {0} 可达，HTTP {1}

# ViteStatusHttpErrorFormat
source: {0} responded with HTTP {1}
zh_cn: {0} 已响应，但状态码为 HTTP {1}

# ViteStatusOfflineFormat
source: {0} is not reachable
zh_cn: {0} 暂不可达

# ViteHealthCheckFailedFormat
source: Status check failed: {0}
zh_cn: 状态检查失败：{0}

# ViteHmrDisconnectedHint
source: The dev server disconnected after being online. HMR may be stale; retry the connection or reload the current container.
zh_cn: 开发服务器刚才断开，HMR 可能已失效。可重试连接或重新加载当前容器。

# ViteProcessAlreadyRunning
source: The Vite start command is already running.
zh_cn: Vite 启动命令已在运行。

# ViteWorkingDirectoryMissingFormat
source: Project folder does not exist: {0}
zh_cn: 项目目录不存在：{0}

# ViteProcessStartedFormat
source: Started: {0}
zh_cn: 已启动：{0}

# ViteProcessStartFailedFormat
source: Start failed: {0}
zh_cn: 启动失败：{0}

# ViteProcessNotRunning
source: No Vite start command is running.
zh_cn: 没有正在运行的 Vite 启动命令。

# ViteProcessStopRequested
source: Stop requested for the start command.
zh_cn: 已请求停止启动命令。

# ViteProcessStopFailedFormat
source: Stop failed: {0}
zh_cn: 停止失败：{0}

# ViteWorkingDirectoryNotSet
source: Project folder has not been set.
zh_cn: 尚未设置项目目录。

# ViteOpenFolderFailedFormat
source: Failed to open project folder: {0}
zh_cn: 打开项目目录失败：{0}

# ViteDevContainerDisplayName
source: Vite debug
zh_cn: Vite 调试

# ViteReloadUnavailable
source: There is no current container to reload.
zh_cn: 当前没有可重新加载的容器。

# ViteReloadRequested
source: Reloaded the current container.
zh_cn: 已重新加载当前容器。

# ViteProcessExited
source: The Vite start command exited.
zh_cn: Vite 启动命令已退出。

# ContainerSettingsCard.Header
source: Container management
zh_cn: 容器管理

# ContainerSettingsCard.Description
source: Edit name, URL, icon, Start menu entry, and container data
zh_cn: 编辑名称、网址、图标、开始菜单和容器数据

# ContainerDiagnosticsCard.Header
source: Developer diagnostics
zh_cn: 开发者诊断

# ContainerDiagnosticsCard.Description
source: Inspect WebView, origin, profile, and manifest state
zh_cn: 查看 WebView、origin、profile 和 manifest 状态

# ContainerDiagnosticUrlLabel.Text
source: Current URL
zh_cn: 当前 URL

# ContainerClearCacheButton.Content
source: Clear cache
zh_cn: 清缓存

# ContainerReinjectScriptsButton.Content
source: Reinject scripts
zh_cn: 重新注入脚本

# ContainerOpenDevToolsButton.Content
source: Open DevTools
zh_cn: 打开 DevTools

# ContainerCopyDiagnosticsButton.Content
source: Copy environment info
zh_cn: 复制环境信息

# ContainerDiagnosticManifestMissing
source: No manifest name parsed
zh_cn: 未解析到 manifest 名称

# ContainerDiagnosticRuntimeUnavailable
source: Unable to read WebView2 Runtime version
zh_cn: 无法读取 WebView2 Runtime 版本

# ContainerDiagnosticNameLabelText
source: Name
zh_cn: 名称

# ContainerDiagnosticUrlLabelText
source: Current URL
zh_cn: 当前 URL

# ContainerDiagnosticProfileLabelText
source: Profile path
zh_cn: Profile 路径

# ContainerDiagnosticManifestLabelText
source: Manifest parse result
zh_cn: Manifest 解析结果

# LauncherDeveloperExpander.Header
source: Developer
zh_cn: 开发者

# LauncherVitePortNumberBox.Header
source: Port
zh_cn: 端口

# LauncherViteUsePathCheckBox.Content
source: Append suffix
zh_cn: 附加后缀

# LauncherVitePathBox.Header
source: Suffix
zh_cn: 后缀

# LauncherVitePathBox.PlaceholderText
source: For example app/ or docs/
zh_cn: 例如 app/ 或 docs/

# LauncherViteUseUrlButton.Content
source: Use debug URL
zh_cn: 使用调试地址
